#ifndef	_CHECK_TOUCH_KEY_H_
#define	_CHECK_TOUCH_KEY_H_
/****************************************************************************/
/** \file CheckTouchKey_80F761x.h
**	History:
*****************************************************************************/
/****************************************************************************/
/*	include files
*****************************************************************************/
#include "CheckTouchKeyConst_80F761x.h"
#include "cms80f761xx.h"
/****************************************************************************
		extern	
*****************************************************************************/
extern volatile bit gf_kerr;				//复位按键标志

//每个按键对应于寄存器的1个位,由高至低一一对应
//KeyFlag对应于Key31,Key30,...,Key1,Key0
//按键有效时相应位为1,无效时为0
extern volatile unsigned long int xdata KeyFlag;

//接口函数声明
extern void __CMS_CheckTouchKey(void);		//按键扫描主过程函数,建议在1ms~5ms内调用


#endif//_CHECK_TOUCH_KEY_H_





